[
  {
    "name": "Mr. Jeff Pottinger",
    "title": "Co-Founder",
    "organization": "ReLAUNCH Advisors",
    "bio": "I’ve dedicated my career to helping individuals and organizations unlock potential, improve engagement, and achieve meaningful results. With 24 years in the Navy Supply Corps and another 24 years in the commercial sector, I bring firsthand experience navigating the complexities of career transitions and building thriving teams.\r\n\r\nWhether you’re moving into a new professional chapter or striving to create a more engaged and aligned workforce, I provide the tools and strategies to make it happen.\r\n\r\nAs a certified WHY.os Activator and Gallup-certified Strengths Coach, I specialize in career transition and employee engagement.\r\n\r\nFor individuals, I help uncover your WHY, identify your Strengths, and craft personal brand narratives that open doors to new opportunities.\r\n\r\nFor organizations, I deliver transformative workshops that align employees’ WHY and Strengths with organizational goals, creating a culture of purpose, engagement, and high performance.\r\n\r\nOne of the most rewarding parts of my work is seeing individuals and teams step into their potential. As one client said:\r\n\r\n“Jeff’s ability to combine WHY and Strengths into actionable strategies completely changed the way I approach my career. I walked away with clarity, confidence, and a renewed sense of purpose.”\r\n\r\nWHAT I Offer\r\nI help professionals and organizations gain clarity and build confidence in sharing the unique value they bring to the world. My approach is personalized, practical, and rooted in uncovering what drives you or your team—and how to use that knowledge to achieve your goals.\r\n\r\nHOW I Can Help:\r\n1:1 Coaching Sessions – Discover your WHY, identify your Strengths, and craft a personal brand narrative you can use across your LinkedIn profile, resume, interviews, and networking.\r\n\r\nEmployee Engagement Workshops – Inspire employee engagement and align individual WHY and Strengths with organizational goals.\r\n\r\nCareer Transition Seminars – Work closely with veterans and professionals to provide tailored strategies for navigating your next career move.\r\n\r\nWHY We Should Work Together\r\nAre you ready to uncover your WHY, harness your Strengths, and build a career narrative or organizational culture that reflects the real you?\r\n\r\nLet’s connect and explore how I can help you or your team achieve your goals. Reach out to me today at jeff.pottinger@relaunchadvisors.com!"
  },
  {
    "name": "Mr. Matt Stevens",
    "title": "Chief Executive Officer",
    "organization": "The Honor Foundation",
    "bio": "Matt Stevens is the Chief Executive Officer of The Honor Foundation (THF) and a member of its board of directors. Previously, Matt served as a Navy SEAL for 26 years, where he led high-performing teams conducting our nation’s most sensitive operations, cultivated interagency relationships, and executed operations in the most dynamic environments. Immediately following his Navy career, Matt served on the leadership team of an emerging technology firm.\r\n\r\nMatt graduated from the U.S. Naval Academy with a B.S. in Ocean Engineering and completed Basic Underwater Demolition/SEAL (BUD/S) training with class 179. He commanded at every level in the Naval Special Warfare Community, including a Squadron at Naval Special Warfare Development Group, SEAL Team TWO, Naval Special Warfare Unit THREE, and Naval Special Warfare Group FOUR.\r\n\r\nHe also served in staff roles at the Joint Special Operations Command in Fort Bragg, NC; as the Operations Officer at Naval Special Warfare Group TWO in Virginia Beach, VA; and in the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (ASD SO/LIC) in the Pentagon.\r\n\r\nMatt is a graduate of THF’s program and remains deeply passionate about serving others and advocating for veterans’ issues. In his free time, he enjoys exploring the great outdoors."
  },
  {
    "name": "Mr. William \"Bill\" Innes",
    "title": "Deputy Director, Acquisition, SOF AT&L",
    "organization": "U.S. Special Operations Command",
    "bio": "Mr. Innes entered civil service upon graduation from St. Louis University in 1993 and subsequent positions in industry. His initial government assignment in 1997 was to the San Antonio Air Logistics Center, Kelly AFB, TX, providing engineering support to the propulsion directorate and later the C-17 program on-site at Charleston AFB, SC. Following a short period at Warner-Robins ALC, Mr. Innes was assigned to the Aeronautical Systems Center, Wright-Patterson Air Force Base, Ohio supporting the F-22 program as Chief Sustainment Engineer. This led to his selection as the CV-22 Chief Engineer at Patuxent River NAS. Mr. Innes then broadened his DoD organizational and technical knowledge base as Senior Defense Analyst in the Office of the Secretary of Defense, AT&L (Industrial Policy). In 2009, Mr. Innes volunteered for a 12-month assignment to Kabul, Afghanistan supporting Operation Enduring Freedom where he supported the US Army and US Agency for International Development as a Program Manager for large infrastructure projects throughout the country. Upon completion of the assignment, Mr. Innes returned to the Air Force and the CV-22 program, taking on the role of Deputy Program Manager. In 2012 he was assigned to USTRANSCOM as Division Chief for a portfolio of Information Technology programs. He was promoted to SES and assigned as Deputy Director, Acquisition for USSOCOM in May 2019."
  },
  {
    "name": "Ms. Meaghan Keeler",
    "title": "Chief Operating Officer",
    "organization": "Global SOF Foundation",
    "bio": "Ms. Meaghan Keeler is the founding Chief Operating Officer of the Global SOF Foundation and an International Security Fellow at New America. She is responsible for the Foundation’s operations, financial stewardship, and program delivery. Prior to her position with the Foundation, Ms. Keeler worked for CACI supporting Operational Planning Teams at U.S. Special Operations Command. In this capacity, Ms. Keeler managed a team of analysts, subject matter experts, writers, research associates, and strategic communicators. Previously, she worked in the Commander’s Action Group and Operations Directorate at U.S. Central Command, supporting the 4-star commander. Ms. Keeler was also the Interim Executive Director and Events Coordinator for Women In International Security, a non-profit professional membership organization for women who work in international affairs.\r\n\r\nShe holds master’s and bachelor’s degrees from Georgetown University’s Walsh School of Foreign Service. She lives in St. Petersburg, FL."
  },
  {
    "name": "Ms. Leslie Babich",
    "title": "Director",
    "organization": "SOFWERX",
    "bio": "Leslie Babich joined the DEFENSEWERX team to lead SOFWERX in Tampa, FL in October 2020. As the Director of SOFWERX, Leslie provides operational and personnel oversight while developing and implementing business plans that optimize results for its government partner, the United States Special Operations Command (USSOCOM).\r\n\r\nLeslie brings 20+ years of special operations experience where she served as an MC-130E/H Pilot in Air Force Special Operations Command and held various leadership positions to include squadron command, Director of the Commander’s Action Group at Headquarters, Air Force Special Operations Command, and Commander, Joint Special Operations Air Component - Central. She also served as the Fixed-Wing Assessment Director and Chief of Program Analysis and Evaluation at the United States Special Operations Command in the Force Structure, Requirements, Resources and Strategic Assessment Directorate. During her service, she deployed multiple times in support of Operations Enduring Freedom, Enduring Freedom-Philippines, Iraqi Freedom, and Inherent Resolve. Prior to joining SOFWERX, Leslie was employed as a Business Unit Manager with Jabil Defense and Aerospace in Saint Petersburg, FL.\r\n\r\nLeslie received her Bachelor of Science in Management from the Air Force Academy, her Master of Arts in Counseling and Leadership from the University of Colorado, and her Master of Science in International Strategic Studies from the Air War College at Maxwell AFB."
  },
  {
    "name": "Mr. Glen Cullen",
    "title": "Program Manager, SOF AT&L",
    "organization": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Travis Owens",
    "title": "Chief, Visual Multimedia Support Division",
    "organization": "U.S. Special Operations Command",
    "bio": "Travis Owens serves as the Chief, Visual Multimedia Support Division, United States Special Operations Command, MacDill AFB, FL. His office provides internal visual information product support to the United States Special Operations Command Headquarters (USSOCOM HQ) and the SOF enterprise.\r\n\r\nHe enlisted in the United States Army in 2002 and was assigned to the 4th Psychological Operations Group (4th POG), Ft. Bragg, NC. As a Multimedia Illustrator (25M) and paratrooper in 3rd Battalion Bravo Company, he created radio, video, and print products for use in tactical Psychological Operations (PSYOP). He then deployed to Afghanistan in support of Operation Enduring Freedom, attached to 3rd Special Forces Group, conducting PSYOP product development and dissemination.\r\n\r\nIn 2006, after his time in the military, Mr. Owens began his career as a government civilian at the United States Special Operations Command (USSOCOM) Headquarters, MacDill AFB, FL. He is a plank holder with the Joint Psychological Operations Support Element (JPSE), Product Development Branch (PDB), where he served as an Audio-Visual Specialist creating strategic PSYOP video products. This organization was later renamed the Joint Military Information Support Command (JMISC) and subsequently relocated to Ft. Bragg, NC. Mr. Owens was then transferred to the Visual Information Center (VIC), later renamed the Visual Multimedia Support Division (VMSD) within USSOCOM HQ, and tasked with creating internal video products in support of the Commander’s priorities. In 2019, he assumed his current position as Chief of the VMSD (GS-13 1084).\r\n\r\nMr. Owens earned his Bachelor of Fine Arts degree in Broadcast Design from the Savannah College of Art and Design, graduating in 2000. He later acquired a Master of Strategic Intelligence from the National Intelligence University in 2018. His thesis, entitled \"Visual Information Support to J2 Intelligence Products within USSOCOM Headquarters,\" analyzed and compared how the United States Special Operations Command and United States Central Command utilize Visual Information in their intelligence products. Mr. Owens has been awarded and recognized multiple times for his outstanding ability to produce unparalleled video, graphic design, and print products."
  },
  {
    "name": "Ms. Lisa R. Sanders",
    "title": "Director, Science and Technology Directorate",
    "organization": "U.S. Special Operations Command",
    "bio": "Ms. Lisa R. Sanders is the Director of Science and Technology for Special Operations Forces, Acquisition, Technology & Logistics (SOF AT&L), U.S. Special Operations Command (USSOCOM), MacDill Air Force Base, Florida. She is responsible for all research and development funded activities and has over 30 years of civilian federal service.\r\n\r\nMs. Sanders began her federal career as an Electronics Engineer at the Naval Avionics Center in Indianapolis, Indiana, where she served in quality engineering, production engineering, and program management roles. In 1996, she transferred to the Naval Air Warfare Center and Naval Air Systems Command (NAVAIR) at Patuxent River, Maryland, serving as an Electronics Engineer and Program Manager for the E-2C Hawkeye aircraft.\r\n\r\nIn 2003, she assumed responsibility for the production and modification of the CV-22 Osprey. During her time at NAVAIR, she managed one of the first Multi-Year Procurements and executed the modification and delivery of CV-22 production and developmental test aircraft.\r\n\r\nMs. Sanders transferred to USSOCOM in 2005, where she continued overseeing CV-22 production and served as the Systems Acquisition Manager for the C-130 program in the Program Executive Office Fixed Wing, managing all C-130 projects across the SOF inventory.\r\n\r\nIn 2010, she was promoted to Deputy Director for the Science and Technology Directorate, and in 2011, she assumed the role of Director of Science & Technology.\r\n\r\nIn 2014, Ms. Sanders left USSOCOM to attend the Defense Acquisition University Senior Service College Fellowship in Aberdeen, Maryland. Upon graduating in 2015, she was assigned to Headquarters, Air Force, where she served as Chair of the Air Force Capability Development Working Group. In 2016, she was selected as a Defense Intelligence Senior Leader.\r\n\r\nMs. Sanders has two children and two grandchildren.\r\n\r\nEducation:\r\n\r\nGMI Engineering & Management Institute, Flint, MI — Bachelor of Science, Mechanical Engineering, 1987\r\n\r\nSt. Leo University, St. Leo, FL — Master’s, Business Administration, 2010\r\n\r\nSenior Service College Fellowship, Aberdeen, MD — Senior Professional Military Education, 2015"
  },
  {
    "name": "Ms. Melissa Johnson",
    "title": "Acquisition Executive",
    "organization": "U.S. Special Operations Command",
    "bio": "Melissa A. Johnson, a member of the Senior Executive Service, is the Acquisition Executive, U.S. Special Operations Command, MacDill Air Force Base, Florida. Ms. Johnson serves as the principal advisor to the Commander, United States Special Operations Command for Special Operations Research and Development, test, production, fielding, and sustainment of SOF-peculiar programs across aviation, space, cyber, maritime, ground, weapons, and communication systems.\r\n\r\nMs. Johnson graduated from the University of Florida in 1995 and received her commission from the United States Air Force Officer Training School in March 1996. Throughout her 24 years on active duty, Ms. Johnson served in a variety of assignments and leadership roles ranging from Program Manager for a highly classified strategic combat system directed by the Deputy Secretary of Defense, to other significant leadership roles such the Director for non-standard Aircraft Systems and Materiel Leader for Strategic Combat Systems, Air Force Rapid Capabilities Office. For her final assignment, she served as the Program Executive Officer for Fixed Wing Programs, Headquarters U.S. Special Operations Command.\r\n\r\nPrior to her position as the Acquisition Executive, Ms. Johnson served as the Deputy Director and Acting Director for the Department of the Air Force’s Rapid Capabilities Office. She oversaw selected study, development, and fielding activities tasked directly by the Under Secretary of Defense for Acquisition and Sustainment, Under Secretary of Defense for Research and Engineering, the Secretary of the Air Force, Air Force Chief of Staff, the Chief of Space Operations, the Assistant Secretary for the Air Force for Acquisition, Technology and Logistics, and the Assistant Secretary of the Air Force for Space Acquisition and Integration. She delivered capabilities at the speed of emerging threats for combat Air and Space Forces and Combatant Command requirements, leveraging streamlined acquisition methods to developing, acquiring, and fielding of critical capabilities. Current programs under the purview of the organization include the X-37B Orbital Test Vehicle, a reusable, unmanned space test platform for the U.S. Space Force, and the B-21 Raider, a long-range strike bomber for the U.S. Air Force."
  },
  {
    "name": "Colonel Clarence E. Burton, Jr.",
    "title": "Director of Procurement",
    "organization": "U.S. Special Operations Command",
    "bio": "Colonel Burton is the Director of Procurement for the United States Special Operations Command. His role is to rapidly deploy contracting expertise resulting in superior technologies, equipment, and services for Special Operations Forces. \r\n\r\nColonel Burton entered the Air Force in 2003 through the Reserve Officer Training Corps at The Citadel, Charleston, S.C. He is a joint qualified officer and has served as a two-time squadron commander, and a contracting officer for the Warner Robins Air Logistics Complex and Special Operations Command Europe. His career also includes a broadening assignment as a Program Element Monitor in the Office of the Assistant Secretary of the Air Force for Acquisition, Technology, and Logistics’ Global Power Programs Directorate.  In this role, Colonel Burton directed acquisition planning, programming, budgeting, and execution for the $13 billion F-15C, F-15E, and F-15EX investment portfolios.  In 2007, Colonel Burton deployed to Kabul, Afghanistan as a Contingency Contracting Officer in support of OPERATION ENDURING FREEDOM.\r\n\r\nPrior to his current assignment, Colonel Burton was a military student assigned to the Dwight D. Eisenhower School for National Security and Resource Strategy at the National Defense University in Washington D.C."
  },
  {
    "name": "Mr. John Burnham",
    "title": "CAPTAIN, USN (Ret.); Former Deputy Assistant Secretary of Defense",
    "organization": "Global SOF Advisory Board",
    "bio": "John Burnham serves as Mission Command Integration lead for the Defense & Intel portfolio of Accenture Federal Services, serving clients across the DoD and Intelligence Communities.\r\n\r\nBefore joining Accenture in 2017 he was a naval officer serving in Naval Special Warfare for 28 years and deploying around the world in tactical, operational and command levels. After retiring from active duty in 2014 he was appointed Deputy Assistant Secretary of Defense and served for three years in the Obama administration. His military assignments include deployments as a Surface Warfare Officer onboard USS MARVIN SHIELDS (FF-1066); tactical and senior operational leadership tours at SEAL Team TWO, Naval Special Warfare Development Group, and Joint Special Operations Command (JSOC); command of SEAL Team FOUR; numerous deployments in command of Joint Special Operations Task Forces in Afghanistan, Iraq, and other locations; and command of JSOC’s Joint Interagency Task Force.\r\n\r\nMr. Burnham is a graduate of the University of Pennsylvania, holds an MBA from the College of William & Mary and is a Distinguished Graduate of the National War College. He and his family live in Arlington, Virginia."
  },
  {
    "name": "Mayor Jane Castor",
    "title": "Mayor",
    "organization": "City of Tampa",
    "bio": ""
  },
  {
    "name": "The Honorable Pete Hegseth",
    "title": "Secretary of Defense",
    "organization": "U.S. Department of Defense",
    "bio": "The Honorable Pete Hegseth is the 29th Secretary of Defense, sworn in on Jan. 25, 2025.\r\n\r\nHegseth was commissioned as an infantry officer in the U.S. Army National Guard after graduating from Princeton University in 2003. He participated in a number of active-duty deployments during his time in service, including operations in Guantanamo Bay, Iraq and Afghanistan. Hegseth also served in multiple staff positions in the National Guard.\r\n\r\nHegseth's military awards include two Bronze Star Medals, the Joint Commendation Medal, two Army Commendation Medals, the Combat Infantryman Badge (CIB) and the Expert Infantryman Badge (EIB). He has authored five books, including the New York Times best-seller The War on Warriors (2024)."
  },
  {
    "name": "General Bryan P. Fenton",
    "title": "Commander",
    "organization": "U.S. Special Operations Command",
    "bio": "General Bryan P. Fenton is a career Special Forces (Green Beret) Officer. He currently serves as the 13th Commander of the U.S. Special Operations Command (USSOCOM), located at MacDill Air Force Base, FL. He oversees all Special Operations for the U.S. Department of Defense with 70,000 Army, Navy, Air Force, and Marine Special Operations personnel and an annual budget of $14 billion.\r\n\r\nBefore assuming command of USSOCOM, General Fenton served as the Commander of Joint Special Operations Command (JSOC), headquartered at Fort Liberty, NC. Prior to that, he was the Senior Military Assistant for two U.S. Secretaries of Defense.\r\n\r\nGeneral Fenton’s other general officer assignments include: Deputy Commander of U.S. Indo-Pacific Command; Commander of U.S. Special Operations – Pacific; and Deputy Commanding General of the U.S. Army’s 25th Infantry Division in Hawaii.\r\n\r\nHe has commanded at all levels and his Joint and Special Operations assignments include: Director of Operations (J3) at the Joint Special Operations Command; Brigade, Battalion, and Squadron Commands; multiple overseas Task Force Commands; Detachment Commander and Operations Officer in 1st Battalion, 7th Special Forces Group (Airborne); as well as Infantry Rifle Platoon Leader and Executive Officer in Bravo Company, 4th Battalion, 502 Infantry Regiment (Berlin).\r\n\r\nGeneral Fenton deployed multiple times, participating in Operation Joint Forge (Bosnia); Operation Enduring Freedom (Afghanistan/Africa); Operations Iraqi Freedom and Inherent Resolve (Iraq); and Operation Pacific Eagle (Philippines). He has served in multiple Areas of Responsibility including U.S. Southern Command; U.S. European Command; U.S. Africa Command; U.S. Central Command; and U.S. Indo-Pacific Command.\r\n\r\nHis U.S. military training includes: the U.S. Army Infantry Officer Basic and Advanced Courses; the U.S. Army Special Forces Qualification Course; U.S. Army Ranger School; Special Forces Language Training (Spanish); Special Forces Military Free Fall (MFF); along with French Commando Training and the Ecuadorian Jungle Training Course.\r\n\r\nGeneral Fenton’s awards include: the French Commando Badge; the Cruz de la Victoria Medal from Chile; Princess of Thailand awarded Thai Jumpmaster Wings; the University of Notre Dame’s Moose Krause Service Award and its Rev. William Corby Award for Distinguished Military Service; and the Business Executives for National Security (BENS) Eisenhower Award."
  },
  {
    "name": "Command Sergeant Major Shane Shorter",
    "title": "Senior Enlisted Leader",
    "organization": "U.S. Special Operations Command",
    "bio": "Command Sergeant Major Shorter enlisted in the Army in 1988 and attended Infantry Basic Training and Advanced Individual Training at Fort Benning, GA. He was subsequently assigned to 3rd Infantry Division in Kitzingen, Germany.\r\n\r\nCommand Sergeant Major Shorter volunteered for Special Forces training and graduated the Special Forces Qualification Course in 1992. He was then assigned to 3rd Battalion, 1st Special Forces Group (A) at Fort Lewis Washington. During the following 23 years, he has held the positions of Junior Medical NCO, Senior Medical NCO, Team Sergeant and HSC First Sergeant. His Sergeant Major assignments with 1st Special Forces Group include: OPSDET Sergeant Major, Company Sergeant Major for Charlie Company 3rd Battalion, Group Operations Sergeant Major, 1st Battalion Command Sergeant Major and Group Command Sergeant Major. Command Sergeant Major Shorter’s nominative positions include the Command Senior Enlisted Leader of Special Operations Command Pacific, United States Indo-Pacific Command, and Joint Special Operations University (JSOU).\r\n\r\nCommand Sergeant Major Shorter’s military education includes every level of Non- Commissioned Officer Professional Development, to include the Summit Course. He is a graduate of the Special Forces Qualification Course, Special Forces Operations and Intelligence Course, Static Line Jumpmaster Course, Dive Medical Technician’s Course and the Military Free Fall Parachutist Course.\r\n\r\nCommand Sergeant Major Shorter’s awards and decorations include the Defense Superior Service Medal, Bronze Star Medal, Meritorious Service Medal, Army Commendation Medal with “V” device, and Army Achievement Medal. He has been awarded the Special Forces Tab, Combat Infantryman’s Badge, Expert Infantryman’s Badge, Expert Field Medic Badge, Master Parachutist Badge, Military Free Fall Parachutist Badge, and the Saint Phillip of Neri Award (Bronze Order).\r\n\r\nCommand Sergeant Major Shorter and his wife Leslie have been married 33 years and have one daughter, Kelcie, 28, who is a speech language pathologist and resides in Washington."
  },
  {
    "name": "Ms. Melissa Johnson",
    "title": "Acquisition Executive",
    "organization": "U.S. Special Operations Command",
    "bio": "Melissa A. Johnson, a member of the Senior Executive Service, is the Acquisition Executive, U.S. Special Operations Command, MacDill Air Force Base, Florida. Ms. Johnson serves as the principal advisor to the Commander, United States Special Operations Command for Special Operations Research and Development, test, production, fielding, and sustainment of SOF-peculiar programs across aviation, space, cyber, maritime, ground, weapons, and communication systems.\r\n\r\nMs. Johnson graduated from the University of Florida in 1995 and received her commission from the United States Air Force Officer Training School in March 1996. Throughout her 24 years on active duty, Ms. Johnson served in a variety of assignments and leadership roles ranging from Program Manager for a highly classified strategic combat system directed by the Deputy Secretary of Defense, to other significant leadership roles such the Director for non-standard Aircraft Systems and Materiel Leader for Strategic Combat Systems, Air Force Rapid Capabilities Office. For her final assignment, she served as the Program Executive Officer for Fixed Wing Programs, Headquarters U.S. Special Operations Command.\r\n\r\nPrior to her position as the Acquisition Executive, Ms. Johnson served as the Deputy Director and Acting Director for the Department of the Air Force’s Rapid Capabilities Office. She oversaw selected study, development, and fielding activities tasked directly by the Under Secretary of Defense for Acquisition and Sustainment, Under Secretary of Defense for Research and Engineering, the Secretary of the Air Force, Air Force Chief of Staff, the Chief of Space Operations, the Assistant Secretary for the Air Force for Acquisition, Technology and Logistics, and the Assistant Secretary of the Air Force for Space Acquisition and Integration. She delivered capabilities at the speed of emerging threats for combat Air and Space Forces and Combatant Command requirements, leveraging streamlined acquisition methods to developing, acquiring, and fielding of critical capabilities. Current programs under the purview of the organization include the X-37B Orbital Test Vehicle, a reusable, unmanned space test platform for the U.S. Space Force, and the B-21 Raider, a long-range strike bomber for the U.S. Air Force."
  },
  {
    "name": "Ms. Sarah P. Roder, CFEI",
    "title": "Director of Partnerships and Member Engagement",
    "organization": "AAFMAA",
    "bio": "Sarah Roder is the Director of Partnerships and Member Engagement at AAFMAA. She previously served as a Relationship Manager for AAFMAA Wealth Management and Trust, Senior Veterans Affairs Coordinator, the SpouseLink Ambassador for the Camp Lejeune area, and a member of the Member Benefits Team.\r\n\r\nSarah holds the Certified Financial Education Instructor® designation, having completed the National Financial Educators Council Program. As a military spouse and mother, she enjoys spending time outdoors and helping others. She is a proud graduate of Auburn University."
  },
  {
    "name": "Mr. Arthur Coon",
    "title": "Director of Enterprise Information Systems",
    "organization": "SOF AT&L, U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Liliana Roman",
    "title": "Deputy Director, Enterprise Information Systems (EIS), SOF AT&L",
    "organization": "U.S. Special Operations Command",
    "bio": "Ms. Liliana Roman, currently serving as the Deputy Director for Enterprise Information Systems (EIS) at the U.S. Special Operations Command (USSOCOM), brings a rich blend of expertise and leadership to her role. Appointed in May 2023, she oversees the development of fieldable prototypes and manages the acquisition and sustainment of SOF Garrison C4 Systems and Military Information Support Systems at MacDill Air Force Base in Florida. Her current position involves the oversight of seven key acquisition programs, with a substantial annual budget exceeding $618 million.\r\n\r\nMs. Roman's career in federal service spans over 24 years, dedicating a significant portion of it to the Department of Defense. Her journey at USSOCOM is marked by 21 years of diverse experiences, where she notably contributed as Program Manager for Enterprise Networks and Acquisition Program Manager (APM) across various departments. Her roles included managing the Civil Information Management Data Processing System/Media Production Center (MPC) Enterprise, overseeing the Next Generation Infrastructure (NGI), and leading the C4IAS program.\r\n\r\nBefore her tenure at USSOCOM, Ms. Roman served in the United States Army as a 25B, where she honed her skills and knowledge in information systems. Complementing her extensive professional experience, she holds a Bachelor of Science degree in Management Information Systems from the University of Tampa. This academic background, combined with her practical experience, positions her as a leader adept at navigating the complex landscape of information systems within the defense sector."
  },
  {
    "name": "Mr. Peter Bergen",
    "title": "Vice President Global Studies & Fellows, New America; Professor, Arizona State University;",
    "organization": "CNN National Security Analyst; Chairman of the Board, Global SOF Foundation",
    "bio": "Peter Bergen is a journalist, documentary producer, vice president at New America, CNN national security analyst, professor of practice at Arizona State University, and the author or editor of ten books, three of which were New York Times bestsellers and four of which were named among the best non-fiction books of the year by the Washington Post. The books have been translated into twenty-four languages, and documentaries based on them have been nominated for two Emmys and won the Emmy for best documentary.\r\n\r\nBergen also serves as New America’s Director of the International Security and Future of War programs. He writes a weekly column for CNN.com. He is a member of the Homeland Security Experts Group and a fellow at Fordham University’s Center on National Security. Bergen is on the editorial board of Studies in Conflict & Terrorism, a leading scholarly journal. He has held teaching positions at the Kennedy School of Government at Harvard University and the School of Advanced International Studies at Johns Hopkins University. For many years he was a fellow at New York University’s Center on Law and Security. He has testified before US Congressional committees eighteen times about national security issues.\r\n\r\nIn 2011 he published The Longest War: The Enduring Conflict between America and Al-Qaeda. The book won the Washington Institute’s Gold Prize for the best book on the Middle East. In 2012 he published Manhunt: The Ten-Year Search for Bin Laden, from 9/11 to Abbottabad. It won the Overseas Press Club award for the best book on international affairs. HBO based the film “Manhunt” on the book, which won the 2013 Emmy for best documentary. In 2013 he published Talibanistan: Negotiating the Borders Between Terror, Politics, and Religion, a collection of essays about the Taliban that Bergen co-edited. In 2014 he published Drone Wars, a collection of essays about drone warfare that Bergen co-edited. In 2016, he published United States of Jihad: Investigating America’s Homegrown Terrorists, and HBO adapted the book for the film “Homegrown: The Counter-Terror Dilemma.” In 2021 he published The Rise and Fall of Osama bin Laden and, in 2022, The Cost of Chaos: The Trump Administration and the World.\r\n\r\nBergen has a degree in Modern History from New College, Oxford. He is married to the documentary director/producer Tresha Mabile. They have two children."
  },
  {
    "name": "Dr. Keenan Yoho",
    "title": "Vice President and Board Member",
    "organization": "Global SOF Foundation",
    "bio": "Dr. Keenan Yoho has spent more than a decade working with senior management leading change in both commercial and public sector environments. Dr. Yoho’s research and applied work is focused on supply chain cost modeling and operations management to achieve enterprise-wide outcomes under conditions of uncertainty and resource scarcity.\r\n\r\nDr. Yoho served as Senior Special Advisor to U.S. Special Operations Command (USSOCOM) from 2012 to 2014. During this time Dr. Yoho worked with a special team reporting directly to the Commander, USSOCOM that was charged with crafting and executing a plan for posturing special operations forces (SOF) for the next three decades. Dr. Yoho has advised several U.S. and international organizations to include IBM (semiconductors), General Motors (autos), General Mills (foods), Intel (semiconductors), Rockwell Automation (machine automation), BASF (chemicals –Germany, US and Mexico), Merck, KGaA (chemicals – Germany), Ryerson (steel processing & distribution), Qualcomm (designer/supplier telecommunications technology), and Polioles SA de CV (chemicals – Mexico), the U.S. Army, U.S. Air Force, and U.S. Transportation Command in the areas of operations management, supply chain management, continuous improvement and organizational transformation.\r\n\r\nPrior to joining the Crummer Graduate School of Business at Rollins College, Dr. Yoho was an associate operations researcher at the RAND Corporation in Santa Monica, California where he led projects to improve the operational effectiveness of the U.S. military during war. Dr. Yoho was recently an assistant professor at the Naval Postgraduate School in Monterey, California where he received 4 consecutive teaching awards including the School’s highest award for excellence in teaching and impact beyond the classroom.\r\n\r\nDr. Yoho has published in the International Journal of Production Economics, International Journal of Operations and Quantitative Management, Journal of Cost Analysis and Parametrics, International Journal of Physical Distribution & Logistics Management, and the Journal of Operations and Supply Chain Management. Dr. Yoho holds a Ph.D. in Operations Management, M.B.A. in Operations Management, and M.S. in Industrial Relations from the University of Wisconsin-Madison. He also holds a B.A. in Religion with a concentration in Chinese and Japanese Buddhism from Temple University."
  },
  {
    "name": "Ms. Emily Harding",
    "title": "Director of Intelligence, National Security Program; Vice President, Defense & Security Department",
    "organization": "Center for Strategic and International Studies",
    "bio": "Emily Harding is Director of the Intelligence, National Security, and Technology (INT) Program and Vice President of the Defense and Security Department at CSIS. As the head of the INT Program, she provides thought leadership on the most critical issues facing intelligence professionals and on the future of intelligence work. She also serves as deputy director of the International Security Program, where she is responsible for leading a team of world-renowned scholars providing policy solutions that shape national security. Drawing on her decades of experience in national security, Emily has established herself as an expert on how technology is revolutionizing national security work. Harding has served in a series of high-profile national security positions at critical moments. While serving as deputy staff director on the Senate Select Committee on Intelligence, she led the committee’s investigation into Russian interference in the 2016 elections, which was lauded for its bipartisanship. At CIA, she led analysts and analytic programs through moments of crisis, including shepherding the Iraq Group during the attempted Islamic State takeover. During a tour at the National Security Council, she served as director for Iran. After leaving the White House, her team ran the first Office of the Director of National Intelligence-led presidential transition, where she was responsible for briefing the incoming administration. Harding is an adjunct lecturer at the Johns Hopkins School of Advanced International Studies. Her analysis has appeared in the Wall Street Journal, BBC, NPR, Bloomberg, and other outlets. Harding holds a master’s degree from Harvard University’s Kennedy School of Government and a bachelor’s degree from the University of Virginia."
  },
  {
    "name": "Colonel Jesse Marsalis",
    "title": "Program Executive Officer, PEO SOF Support Activity (SOFSA)",
    "organization": "U.S. Special Operations Command",
    "bio": "Colonel Jesse R. Marsalis, a native of Natchitoches, LA, enlisted in the Army as a Combat Engineer in 1990. He was commissioned through the U.S. Army Officer Candidate School (OCS) in 1999 and entered the Army’s Acquisition Corps in 2009. COL Marsalis has over thirty-four years of experience in acquisition, combat, and operational assignments. His recent roles include serving as the Program Executive Officer for Special Operations Forces Support Activities at USSOCOM, Executive Officer for the U.S. Government’s COVID-19 vaccine operation (Operation Warp Speed), and Program Manager Special Programs at PEO Special Operations Warrior, USSOCOM. He also served as Legislative Liaison at the Office of the Chief, Legislative Liaison, and as a Defense Fellow to Senator Susan M. Collins (R-ME).\r\n\r\nHis military leadership roles include Chief Program Integrator for the Combat Development Directorate at USASOC, Assistant Program Manager for Fire Support at USSOCOM, Commander of Alpha Company, 1st Special Troops Battalion, 101st Airborne Division, and Brigade Engineer for the 101st Airborne Division during Operation Iraqi Freedom. COL Marsalis has held numerous NCO and enlisted positions, including Squad Leader, Battalion Reconnaissance NCO, Team Leader, and Demolition Specialist in the 8th Engineer Battalion, 1st Cavalry Division, Fort Hood, TX.\r\n\r\nCOL Marsalis holds a bachelor’s degree in Industrial Engineering from the University of Southern Mississippi and several master’s degrees, including Engineering Management from the University of Missouri, Business Administration from Vanderbilt University, Legislative Affairs from George Washington University, and National Resource Strategy from the Dwight D. Eisenhower School for National Security and Resource Strategy.\r\n\r\nHis awards and decorations include the Bronze Star Medal, Defense Meritorious Service Medal, Meritorious Service Medal, Army Commendation Medal, Army Achievement Medals, Combat Action Badge, Parachutist Badge, Air Assault Badge, Ranger Tab, Army Staff Identification Badge, and the Bronze de Fleury Medal.\r\n\r\nCOL Marsalis is married to Cherilynne Whitney Marsalis and they have eight children: Jonathan (23), Elise (22), Riley (20), Mitchell (17), Lillian (14), Benjamin (12), Asher (10), and Nora Jane (7)."
  },
  {
    "name": "Mr. Joel J. Fox",
    "title": "Special Operations Forces Support Activity Program Manager - Expeditionary Support",
    "organization": "U.S. Special Operations Command",
    "bio": "Mr. Joel J. Fox leads a diverse team of six government employees and contractor support personnel. PM-ES provides logistics-related capability development, enhancement, and support programs that deliver operational capabilities, programmatic expertise, and acquisition authority in support of Special Operations Forces.\r\n\r\nPM-ES is responsible to the PEO for managing the Joint Operational Stock Program; Foreign/Non-Standard Weapons, Materiel, and Munitions Program; Mobile Technology and Repair Complex Program; and providing contested logistics support to USSOCOM subordinate units and directorates.\r\n\r\nPrior to assuming his role as the PM for Expeditionary Support, Mr. Fox was the SOF Systems Branch Chief, managing contract support for four SOCOM components, eight PEOs/directorates, five Theater Special Operations Commands (TSOCs), the National Mission Forces, other high-priority units, and other government activities."
  },
  {
    "name": "Mr. Kareem Sykes",
    "title": "Industry & Engagement Program Manager",
    "organization": "Project Spectrum",
    "bio": "Mr. Sykes currently provides Industry & Engagement support for Project Spectrum, a U.S. Department of Defense (DoD) recognized cybersecurity awareness initiative that offers resources, training, and tools toward increasing cybersecurity awareness and hygiene for small businesses in particular. Mr. Sykes provides strategic leadership for a dynamic team of cybersecurity and outreach professionals whose collective aim centers around providing the educational resources and tools small businesses and institutions need to develop, implement, and maintain cybersecurity compliance. He oversees and directs the daily execution of multiple projects within the large-scale program and assures that the initiative adheres to government regulatory guidance. Mr. Sykes also manages contractual requirements to assure that Project Spectrum meets the cost, schedule, and performance goals set by the DoD Office of Small Business Programs (OSBP).\r\n\r\nPrior to joining Project Spectrum, Mr. Sykes served as a dynamic and ITIL v4-certified Program Manager. He amassed more than 15 years of organizational thought leadership experience and leveraged proven Program and Project Management principles, rooted in the Project Management Body of Knowledge (PMBOK®) methodology. Mr. Sykes is particularly adept at implementing enhanced business processes that result in an economy of scale. He is a proven rapport and relationship cultivator who focuses on the three Cs: Customer Service, Collaboration, and Communication. Mr. Sykes has a hallmark for motivating, mentoring, and coaching high-performance teams that deliver scalable results that drive productivity.\r\n\r\nMr. Sykes has a strong track record of successful matrix management of large teams (100+ FTEs), primes, subcontractors, and third-party vendors. He has managed various personnel levels, including Project Managers, Business Process Engineers, IAT II & III Cyber Systems Analysts, Network Engineers, DevOps, Application Support Specialists, Help Desk Technicians (Tier 1–3), Information Assurance Managers, Quality Managers, Sr. Business Analysts, Project Administrators, Training Analysts, and Supervisors.\r\n\r\nMr. Sykes obtained his Bachelor’s degree from the University of Baltimore, having studied Jurisprudence-Pre Law, and holds an A.A. degree in Interdisciplinary Studies as well."
  },
  {
    "name": "Ms. Juliet Funt",
    "title": "Founder and CEO",
    "organization": "Juliet Funt Group",
    "bio": "Featured in top media outlets such as Forbes, CNBC, and Fast Company, Juliet Funt is a globally renowned keynote speaker, tough-love advisor to the Fortune 500, founder and CEO of the efficiency training firm, Juliet Funt Group.\r\n\r\nJuliet is the author of A Minute to Think, nominated for the Next Big Idea Club curated by Malcolm Gladwell, Dan Pink, Susan Cain and Adam Grant. She is an evangelist for freeing the potential of companies by unburdening their talent from busywork, and she has brought her powerful concepts to Spotify, National Geographic, Anthem, Vans, Abbott, Costco, Pepsi, Nike, Wells Fargo, Sephora, Sysco, and ESPN."
  },
  {
    "name": "Mr. John Burnham",
    "title": "CAPTAIN, USN (Ret.); Former Deputy Assistant Secretary of Defense",
    "organization": "Global SOF Advisory Board",
    "bio": "John Burnham serves as Mission Command Integration lead for the Defense & Intel portfolio of Accenture Federal Services, serving clients across the DoD and Intelligence Communities.\r\n\r\nBefore joining Accenture in 2017 he was a naval officer serving in Naval Special Warfare for 28 years and deploying around the world in tactical, operational and command levels. After retiring from active duty in 2014 he was appointed Deputy Assistant Secretary of Defense and served for three years in the Obama administration. His military assignments include deployments as a Surface Warfare Officer onboard USS MARVIN SHIELDS (FF-1066); tactical and senior operational leadership tours at SEAL Team TWO, Naval Special Warfare Development Group, and Joint Special Operations Command (JSOC); command of SEAL Team FOUR; numerous deployments in command of Joint Special Operations Task Forces in Afghanistan, Iraq, and other locations; and command of JSOC’s Joint Interagency Task Force.\r\n\r\nMr. Burnham is a graduate of the University of Pennsylvania, holds an MBA from the College of William & Mary and is a Distinguished Graduate of the National War College. He and his family live in Arlington, Virginia."
  },
  {
    "name": "Lieutenant General (Ret.) Giovanni Tuck",
    "title": "Former Director of Logistics (J4)",
    "organization": "The Joint Staff",
    "bio": "Giovanni Tuck, a retired Air Force Lieutenant General, serves as the Chief Executive Officer at Robbins Gioia, LLC. Prior to joining Robbins Gioia, Lieutenant General Tuck served as the former Director of Logistics (J4), The Joint Staff, a former member of the Army Senior Executive Service as the Deputy Director, Supply, Production and Distribution, Federal COVID - 19 Response, and the Vice President for Global Military and Government Sales, CAE Healthcare, Inc. At CAE Healthcare, Inc. Lieutenant General Tuck led the organization's national and international military and government sales efforts to deliver worldwide safety and training environments from CAE’s vast array of innovative modeling, simulation and education product and services. As Acting Chief Operating Officer, he oversaw all manufacturing and logistics operations to include engineering, supply chain management, production and distribution, and information technology. \r\n\r\nLieutenant General Tuck is a 33-year U.S. Air Force veteran and has a record of exceptional results in demanding, high-pressure environments. He is uniquely skilled in directing global operations, developing strategic plans, improving organizational cultures, and implementing vision, to lead the Joint Force to innovative outcomes. Lieutenant General Tuck possesses extensive experience in developing logistics, transportation, distribution, and supply chain strategies as well as executing strategic planning for major defense programs in partnership with our Allies. He has a proven ability to cultivate high-performing teams and foster collaboration among stakeholders to achieve strategic objectives. \r\n\r\nLieutenant General Tuck holds master’s degrees from Webster University, the Naval War College,  and the National War College and a Bachelor of Science Degree from Texas State University. He  has completed course work at Harvard University and George Washington University. Lieutenant  General Tuck serves as a Senior Advisory Board member to the Veterans Administration on the  GI Bill, and Warrior Rising, a nonprofit helping Veterans succeed in business."
  },
  {
    "name": "Captain Jared W. Wyrick",
    "title": "Program Executive Officer, PEO Maritime",
    "organization": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Mr. Michael Quinn",
    "title": "Founder and Chief Growth Officer",
    "organization": "Tenova LLC",
    "bio": "As a prominent voice in the military-to-civilian transition space, Sergeant Major (Ret.) Michael Quinn led our Nation’s Soldiers for more than 24 years and has an incredible passion for giving back to the Veteran community.\r\n\r\nUpon retirement from the U.S. Army in 2017, Michael gained valuable experience as the Director of Workforce Management at ProSphere, where he built workforce management dashboards, updated employee onboarding programs, built a corporate training program and led veteran recruiting initiatives. ProSphere received the Virginia Values Veterans (V3) Phoenix award as a result of his efforts.\r\n\r\nAfter a year at ProSphere, Michael continued his post-military career progression as a Senior Manager at Ernst & Young (EY) in People Advisory Services, where he led change management, training, and communication work streams for the largest contract in the firm’s Government & Public Sector. Michael also spearheaded a military spouse hiring initiative at EY that resulted in hiring 100+ military spouses for contract roles across the entire United States in less than 90 days.\r\n\r\nBut the overwhelming challenges Veterans faced entering the workforce stayed at the front of Michael’s mind and he resolved to make a difference, so he left EY to focus full-on HireMilitary. Through his interaction with industry leaders, posts on LinkedIn, \r\nworkshops across military installations, personal mentoring, and advising military leaders on transition assistance initiatives, Michael is positively impacting the lives of thousands of Veterans.\r\n\r\nA multi-year member of Forbes Coaches Council and 3x LinkedIn Top Voice with more than 373,000 followers, Michael’s daily posts are intended to provide guidance, motivation, and wisdom that keep the military community “Always Moving Forward” to their next career goal. As the Founder and Chief Growth Officer of HireMilitary, Michael is responsible for the growth of the company and its ecosystem of Veteran-focused brands. \r\n\r\nIn addition to his responsibility as Chief Growth Officer, Michael provides tailored training packages to multi- billion-dollar companies, small businesses, non-profits, and defense organizations to improve their social media marketing, outreach & personal/professional branding. He teaches the power of LinkedIn and networking to General/Flag Officers from all branches of the service as a part of their service transition courses. Michael typically leads 50+ webinars, live events & in-person workshops a year."
  },
  {
    "name": "Ms. Alison Messick",
    "title": "Chief Programs Officer",
    "organization": "Navy SEAL Foundation",
    "bio": "As the Chief Programs Officer of the Navy SEAL Foundation (NSF), Alison leads comprehensive programming and critical support for the NSW force and their families, ensuring growth, stability, and effectiveness. She oversees a $24 million annual budget, evaluates programs for efficacy, and implements policies for improvement. Alison collaborates with experts and thought leaders to drive innovation, addressing key issues and identifying solutions. She also plans and executes NSF's Impact Forum and Thought Leaders' Symposium, fostering collaboration between federal and non-federal entities to enhance collective impact.\r\n\r\nAlison has over 20 years of experience in active duty and support services, specializing in military family readiness and organizational training. She served more than four years as a United States Marine in a frequently deployed unit with high-level security clearance. Previously, she was a Marine Corps Family Readiness Officer and Warrior and Family Support Coordinator at Naval Special Warfare (NSW) Group TWO, earning the Department of the Navy Meritorious Service Civilian Medal for her impact on NSW warriors and families.\r\n\r\nHer deep understanding of the NSW community’s challenges stems from decades of service with the U.S. Marine Corps, U.S. Navy, and Naval Special Warfare. Alison holds a Bachelor of Arts in history and journalism from the University of Maryland University College, a Master of Arts in government from Regent University, and a Graduate Leadership Certificate from the University of Virginia. She is a CliftonStrengths and EQI 2.0/EQ 360 Coach and a member of The National Medal of Honor Leadership Institute Flagship Cohort."
  },
  {
    "name": "Ms. Jennifer Zientz, MS, CCC-SLP",
    "title": "Director of Programs, Head of Clinical Services",
    "organization": "Center for BrainHealth",
    "bio": "Jennifer Zientz, Director of Programs and Head of Clinical Services at Center for BrainHealth®, focuses on the translation of BrainHealth research to improve how people think, work, and live. Jennifer administers performance-based assessments and facilitates training workshops that empower individuals across the lifespan to take the lead in strengthening their focus, mental efficiency, reasoning, and possibility thinking.\r\n\r\nShe has facilitated SMART™ Brain Training for specialized groups, including military leadership, active-duty special operators, veterans and their spouses, law enforcement officers, corporate executives and leadership teams, community leaders, athletes, and graduate students.\r\n\r\nHer career in clinical research and translational application has contributed to the growing knowledge of the impact of cognitive training in health. Jennifer’s early work focused on the important role that complex language processing plays in the diagnosis and treatment of dementias. She also worked to define best practices for speech-language pathologists in the path of care for individuals with Alzheimer’s disease."
  },
  {
    "name": "Mr. Jeffery \"JD\" Barnes",
    "title": "Chief, International Operations, SOF AT&L",
    "organization": "U.S. Special Operations Command",
    "bio": ""
  },
  {
    "name": "Ms. Heidi Grant",
    "title": "Former Director of Defense Security Cooperation Agency",
    "organization": "U.S. Department of Defense",
    "bio": "Heidi Grant is president of business development, where she leads a team representing Boeing’s defense, space and government services portfolios around the world.\r\n\r\nGrant joined Boeing in November 2021 from the U.S. Department of Defense, having served as director, Defense Security Cooperation Agency, responsible for all DoD security cooperation programs involving defense articles, military training and other defense-related services. There, she oversaw more than 15,000 military sales cases with more than 150 countries valued at more than $600 billion. She also managed a certification program for 20,000 civillian and military personnel.\r\n\r\nBefore joining DSCA, Grant was director, Defense Technology Security Administration, responsible for developing and implementing global technology security policies for international transfer of defense-related goods, services, and technologies.\r\n\r\nIn 2002, Grant was appointed to the Senior Executive Service and assigned as the first civilian director, resources and analysis, for U.S. operations in the Middle East, Central and South Asia and North East Africa. Working with senior representatives from 65 countries, she led resource strategy and analysis for operations Iraqi Freedom and Enduring Freedom.\r\n\r\nShe later helped establish U.S. Africa Command as its first director of resources, leading personnel and financial programming that served as the foundation for successful interagency and international partnerships for global security.\r\n\r\nFrom 2010 through 2018, Grant served as deputy under secretary of the Air Force, International Affairs, providing oversight and guidance for international policy and for programs supporting global national security objectives; technology and information disclosure; security assistance; education and training; and cooperative research and development. She also managed the Air Force Foreign Liaison Office and attaché affairs.\r\n\r\nGrant holds a Master of Public Administration in financial management from Troy State University and a Bachelor of Science in business from Pfeiffer University. She is a member of the Council on Foreign Relations."
  },
  {
    "name": "Ms. Lisa R. Sanders",
    "title": "Director, Science and Technology Directorate",
    "organization": "U.S. Special Operations Command",
    "bio": "Ms. Lisa R. Sanders is the Director of Science and Technology for Special Operations Forces, Acquisition, Technology & Logistics (SOF AT&L), U.S. Special Operations Command (USSOCOM), MacDill Air Force Base, Florida. She is responsible for all research and development funded activities and has over 30 years of civilian federal service.\r\n\r\nMs. Sanders began her federal career as an Electronics Engineer at the Naval Avionics Center in Indianapolis, Indiana, where she served in quality engineering, production engineering, and program management roles. In 1996, she transferred to the Naval Air Warfare Center and Naval Air Systems Command (NAVAIR) at Patuxent River, Maryland, serving as an Electronics Engineer and Program Manager for the E-2C Hawkeye aircraft.\r\n\r\nIn 2003, she assumed responsibility for the production and modification of the CV-22 Osprey. During her time at NAVAIR, she managed one of the first Multi-Year Procurements and executed the modification and delivery of CV-22 production and developmental test aircraft.\r\n\r\nMs. Sanders transferred to USSOCOM in 2005, where she continued overseeing CV-22 production and served as the Systems Acquisition Manager for the C-130 program in the Program Executive Office Fixed Wing, managing all C-130 projects across the SOF inventory.\r\n\r\nIn 2010, she was promoted to Deputy Director for the Science and Technology Directorate, and in 2011, she assumed the role of Director of Science & Technology.\r\n\r\nIn 2014, Ms. Sanders left USSOCOM to attend the Defense Acquisition University Senior Service College Fellowship in Aberdeen, Maryland. Upon graduating in 2015, she was assigned to Headquarters, Air Force, where she served as Chair of the Air Force Capability Development Working Group. In 2016, she was selected as a Defense Intelligence Senior Leader.\r\n\r\nMs. Sanders has two children and two grandchildren.\r\n\r\nEducation:\r\n\r\nGMI Engineering & Management Institute, Flint, MI — Bachelor of Science, Mechanical Engineering, 1987\r\n\r\nSt. Leo University, St. Leo, FL — Master’s, Business Administration, 2010\r\n\r\nSenior Service College Fellowship, Aberdeen, MD — Senior Professional Military Education, 2015"
  },
  {
    "name": "Dr. John Edgar Caterson",
    "title": "U.S. Special Operations Command SOCH ESME, SOCH Program Director",
    "organization": "Joint Special Operations University",
    "bio": "Dr. John Edgar Catterson serves as the SOCOM SOCH Joint Special Operations University Executive Subject Matter Expert (ESME) and as the Program Director for the Special Operations Chaplains Advanced Courses Program (SOCAC), as well as the Master SOF Instructor of Record for the SOF Ethical Leadership Advisement, the Spiritual & Moral Resiliency, Special Operations Crisis Care and Counseling, and Religious Support Team Orientation.\r\n\r\nA graduate of Princeton Theological Seminary, The University of Edinburgh in Scotland, and The Beeson International Center at Asbury Theological Seminary, he holds a Bachelor of Arts in Philosophy & Religion, a Master of Divinity with a concentration in ethics, was a Supervised Post-Graduate Fellow in Ethics & Leadership, and earned a Doctorate degree with concentrations in Story Integration, Narrative Theology, Leadership & Ethics, and Psychology."
  }
]